In [1]:
# add 함수: DataFrame에 다른 데이터프레임이나, Series, 스칼라 등 데이터를 더하는 메서드
# DataFrame.add(other, axis='columns', level=None, fill_value=None)
# DataFrame.radd(other, axis='columns', level=None, fill_value=None)
# radd의 경우 add의 경우에서 순서만 바꾼 것

In [2]:
import pandas as pd

In [3]:
data = [[1,10,100],[2,20,200],[3,30,300]]
col = ['col1', 'col2', 'col3']
row = ['row1', 'row2', 'row3']
df = pd.DataFrame(data = data, index = row, columns = col)
df

      col1  col2  col3
row1     1    10   100
row2     2    20   200
row3     3    30   300

In [4]:
# df.add
result = df.add(1)
result

      col1  col2  col3
row1     2    11   101
row2     3    21   201
row3     4    31   301

In [5]:
result = df+1
result

      col1  col2  col3
row1     2    11   101
row2     3    21   201
row3     4    31   301

In [6]:
data2 = [[3], [4], [5]]
df2 = pd.DataFrame(data = data2,
                   index = ['row1', 'row2', 'row3'], 
                   columns = ['col1'])
df2

      col1
row1     3
row2     4
row3     5

In [7]:
result = df.add(df2)
result

      col1  col2  col3
row1     4   NaN   NaN
row2     6   NaN   NaN
row3     8   NaN   NaN

In [8]:
# fill_value : 값을 value로 명시한 값으로 채워넣음
result = df.add(df2, fill_value=0) # fill_Value로 명시한 값으로 채운 뒤 계산
result

      col1  col2   col3
row1     4  10.0  100.0
row2     6  20.0  200.0
row3     8  30.0  300.0

In [9]:
# sub 함수: DataFrame에 다른 데이터프레임이나, Series, 스칼라 등 데이터를 빼는 메서드
# DataFrame.sub(other, axis='columns', level=None, fill_value=None)
# DataFrame.rsub(other, axis='columns', level=None, fill_value=None)

In [10]:
result = df.sub(1)
result

      col1  col2  col3
row1     0     9    99
row2     1    19   199
row3     2    29   299

In [11]:
result = df-1
result

      col1  col2  col3
row1     0     9    99
row2     1    19   199
row3     2    29   299

In [12]:
result = df.sub(df2)
result

      col1  col2  col3
row1    -2   NaN   NaN
row2    -2   NaN   NaN
row3    -2   NaN   NaN

In [13]:
result = df.sub(df2, fill_value=0)
result

      col1  col2   col3
row1    -2  10.0  100.0
row2    -2  20.0  200.0
row3    -2  30.0  300.0

In [14]:
# mul 함수: DataFrame에 다른 데이터프레임이나, Series, 스칼라 등 데이터를 곱하는 메서드
# DataFrame.mul(other, axis='columns', level=None, fill_value=None)
# DataFrame.rmul(other, axis='columns', level=None, fill_value=None)

In [15]:
result = df.mul(2)
result

      col1  col2  col3
row1     2    20   200
row2     4    40   400
row3     6    60   600

In [16]:
result  = df*2
result

      col1  col2  col3
row1     2    20   200
row2     4    40   400
row3     6    60   600

In [17]:
result = df.mul(df2)
result

      col1  col2  col3
row1     3   NaN   NaN
row2     8   NaN   NaN
row3    15   NaN   NaN

In [18]:
result = df.mul(df2,fill_value=0)
result

      col1  col2  col3
row1     3   0.0   0.0
row2     8   0.0   0.0
row3    15   0.0   0.0

In [19]:
# div함수: DataFrame에 다른 데이터프레임이나, Series, 스칼라 등 데이터를 나누는 메서드
# DataFrame.div(other, axis='columns', level=None, fill_value=None)
# DataFrame.rdiv(other, axis='columns', level=None, fill_value=None)

In [20]:
result = df.div(2)
result

      col1  col2   col3
row1   0.5   5.0   50.0
row2   1.0  10.0  100.0
row3   1.5  15.0  150.0

In [21]:
result = df/2
result

      col1  col2   col3
row1   0.5   5.0   50.0
row2   1.0  10.0  100.0
row3   1.5  15.0  150.0

In [22]:
result = df.div(df2)
result

          col1  col2  col3
row1  0.333333   NaN   NaN
row2  0.500000   NaN   NaN
row3  0.600000   NaN   NaN

In [23]:
result = df.div(df2,fill_value=1)
result

          col1  col2   col3
row1  0.333333  10.0  100.0
row2  0.500000  20.0  200.0
row3  0.600000  30.0  300.0

In [24]:
# 나머지
# mod함수: DataFrame에 다른 데이터프레임이나, 
#          Series, 스칼라 등 데이터를 나눴을때의 나머지를 반환하는 메서드
# DataFrame.mod(other, axis='columns', level=None, fill_value=None)
# DataFrame.rmod(other, axis='columns', level=None, fill_value=None)

In [25]:
result = df.mod(7)
result

      col1  col2  col3
row1     1     3     2
row2     2     6     4
row3     3     2     6

In [26]:
result = df%7
result

      col1  col2  col3
row1     1     3     2
row2     2     6     4
row3     3     2     6

In [27]:
result = df.mod(df2)
result

      col1  col2  col3
row1     1   NaN   NaN
row2     2   NaN   NaN
row3     3   NaN   NaN

In [28]:
result = df.mod(df2,fill_value=1)
result

      col1  col2  col3
row1     1   0.0   0.0
row2     2   0.0   0.0
row3     3   0.0   0.0

In [29]:
# 거듭제곱
# pow함수: DataFrame에 다른 데이터프레임이나, Series, 스칼라 등 데이터를 거듭제곱
# DataFrame.pow(other, axis='columns', level=None, fill_value=None)
# DataFrame.rpow(other, axis='columns', level=None, fill_value=None)

In [30]:
result = df.pow(3)
result

      col1   col2      col3
row1     1   1000   1000000
row2     8   8000   8000000
row3    27  27000  27000000

In [31]:
result = df**3
result

      col1   col2      col3
row1     1   1000   1000000
row2     8   8000   8000000
row3    27  27000  27000000

In [32]:
result = df.pow(df2)
result

      col1  col2  col3
row1     1   NaN   NaN
row2    16   NaN   NaN
row3   243   NaN   NaN

In [33]:
result = df.pow(df2,fill_value=0)
result

      col1  col2  col3
row1     1   1.0   1.0
row2    16   1.0   1.0
row3   243   1.0   1.0

In [34]:
# 행렬곱
# dot함수 : 객체간의 행렬곱을 계산
# DataFrame.dot(other)

In [35]:
col = ['col1','col2']
row = ['row1','row2']
data1 = [[1,2],[3,4]]
data2 = [[5,6],[7,8]]
df1 = pd.DataFrame(data=data1)
df2 = pd.DataFrame(data=data2)

In [36]:
df1

   0  1
0  1  2
1  3  4

In [37]:
df2

   0  1
0  5  6
1  7  8

In [38]:
df3 = df1.dot(df2)
df3

    0   1
0  19  22
1  43  50